Tekla.Structures.ModelInternal.dotUIPickerWrapper_t


Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.#ctor(System.Int32)


Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.MaxPicks
The expected length of all arrays associated to the pick result.

Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.PickType


Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.PickEnum


Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.nPoints


Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.Prompt


Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.aX
The x-coordinates of all points.

Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.aY
The y-coordinates of all points.

Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.aZ
The z-coordinates of all points.

Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.IsReferencePointAvailable


Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.aRefX
The x-coordinate of reference point.

Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.aRefY
The y-coordinate of reference point.

Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.aRefZ
The z-coordinate of reference point.

Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.PickCommandStart
Indicates an actual start of pick command, handled in cdelegate.

Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.MoreObjectsLeft


Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.nObjects


Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.nObjectToStart


Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.aObjects


Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.aObjectTypes


Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.SyncCallback


Tekla.Structures.ModelInternal.dotUIPickerWrapper_t.Construct
Constructs a new instance of the Tekla.Structures.ModelInternal.dotUIPicker_t struct.
Returns: A new instance of the Tekla.Structures.ModelInternal.dotUIPicker_t struct.